testAme/labs/lab7/assignment4/reactingFoam/initialConditions/system/functionObjects/surfaces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

surfaces
{
    type            surfaces;
    libs            ("libsampling.so");
    writeControl    runTime;
    writeInterval   0.01;
    surfaceFormat   vtk;
    writeFormat     binary;
    fields          (p T U k);

    interpolationScheme cellPoint;

    surfaces
    (
        k5
        {
            	type            isoSurface;
            	isoField        k;
            	isoValue        5;
            	interpolate     true;
        }
	
	T320
	{	type		isoSurface;
		isoField	T;
		isoValue	320;
		interpolate	true;
	}
	    
	zNormal
        {
            type            cuttingPlane;
            planeType       pointAndNormal;
            point           (0 0 0);
            normal          (0 0 1);
            interpolate     true;
        }

	xNormal
        {
            type            cuttingPlane;
            planeType       pointAndNormal;
            point           (0 0 0);
            normal          (1 0 0);
            interpolate     true;
        }


        outerWalls
        {
            type            patch;
            patches         ("outerWalls");
            interpolate     true;
        }
	splitter
        {
            type            patch;
            patches         ("splitter.*");
            interpolate     true;
        }
    );
}


// ************************************************************************* //
